a = str(input("В каком месяце вы родились?\n"))
n = int(input("А в какой день?\n"))
for i in range(n):
    print("Абра-кадабра")
if a == 'апрель':
    print("\nВы овен!")
if a == 'май':
    print("\nВы телец!")






























if a == 'август':
    print('\nВы лев!')
if a == 'сентябрь':
    print('\nВы дева!')
if a == 'октябрь':
    print('\nВы весы!')
if a == 'ноябрь':
    print('\nВы скорпион!')
if a == 'декабрь':
    print('\nВы стрелец!')
if a == 'март':
    print('\nВы козерог!')



    





